{
    "name":"龙之进化",
    "icon":"draconicevolution:draconium_ingot",
    "category":"patchouli:mods",
    "pages": [
        {
            "type": "text",
            "text": "龙之进化是一个关于龙的模组，添加了一些强力的工具和设备。"
        },
        {
            "type": "text",
            "title": "聚合合成",
            "text": "聚合合成是制作强力武器的重要方式。 $(br)你需要一个聚合核心和一些注入合成装置。"
        },
        {
            "type": "multiblock",
            "multiblock":{
                "pattern":[
                    ["I     I","I  0  I","I     I"],
                    ["I     I","I  C  I","I     I"]
                ],
                "mapping":{
                    "I": "draconicevolution:basic_crafting_injector",
                    "C": "draconicevolution:crafting_core"
                }
            },
            "text": "注入装置应该对着聚合核心，这里是显示问题。"
        },
        {
            "type": "text",
            "text": "只有注入装置需要接电线，把需要的材料放在上面，打开聚合核心的GUI开始制作。你可以直接从 JEI 调用配方，材料会自动放置到附近的注入装置上。"
        },
        {
            "type": "entity",
            "entity": "draconicevolution:draconic_guardian",
            "text": "最强大的Boss。"
        },
        {
            "type": "text",
            "title": "装备",
            "text": "推荐神龙胸甲，带神龙飞行模块、神龙护盾模块（必需）、不死模块和至少2个速度模块。 $(br2)高级传送符咒的闪现功能会很有用，建议给这个功能设置一个按键绑定。"
        },
        {
            "type": "text",
            "title": "混沌水晶",
            "text": "通常的伤害不再能破坏混沌水晶，因为混沌岛中央的混沌晶体会给它们加上能量护盾，这个能量连接可以暂时被混沌伤害干扰。你可以让混沌守卫攻击水晶，或者使用混沌级的武器（如果你有的话）。 $(br2)干扰只能持续几秒钟，所以请尽可能多打一些伤害，然后赶快离开，混沌守卫不会眼睁睁看着你干这个。"
        },
        {
            "type": "text",
            "title": "基础攻击",
            "text": "混沌守卫会时常冲向玩家并试图造成近战伤害，但它更喜欢用火球轰炸玩家。 $(br2)守卫也有基础的闪避动作，如果玩家靠近的时间太长，它会高速飞走，同时用一堆火球掩护自己。 $(br2)火球的攻击力非常大，只需要几个就能击破神龙护盾。$(br2)最好的防御方式就是逃跑或者追上混沌守卫。 （使用神龙飞行模块） "
        },
        {
            "type": "text",
            "title": "进阶攻击",
            "text": "混沌守卫也有更高级的攻击方式，首先它会盘旋在岛中心上空，从混沌晶体吸收能量，这使它暂时免疫任何伤害。经过短暂的充能时间后，它会使出下面几种技能之一。$(br2)$(l)激光$()$(br)这个很好理解，它会放出一束高度聚集的混沌能量，足以在瞬间融化护盾并杀死你（如果你没有不死模块）。$(br2)最好的办法就是躲在黑曜石柱后面，激光无法穿透黑曜石。"
        },
        {
            "type": "text",
            "text": "如果你胆大心细，你可以把激光束引导至一个混沌水晶上面来摧毁它。$(br2)你很容易知道混沌守卫什么时候会发动激光，因为在第一次充能之后，你会听到第二次充能的声音，这是它在积蓄激光能量。$(br2)如果你有朋友跟你一起刷这个boss，而且混沌水晶已被破坏，那个没有被盯上的玩家可以趁机打它几下。 "
        },
        {
            "type": "text",
            "text": "$(l)重力阱$()$(br)在使出下面的攻击之前，混沌守卫会使用混沌晶体的力量制造一个强大的重力阱来防止你逃离，这也会封印你的创造模式飞行的能力，建议使用喷气背包飞行。$(br2)这时高级传送符咒的闪现功能就很有用了，这能让你快速逃脱攻击范围。$(br2)$(l)轰炸$()$(br)这也是种简单的攻击，混沌守卫会锁定你的位置并发射若干火球。如果你跑得不够快，你很可能会死。"
        },
        {
            "type": "text",
            "text": "$(l)多阶段攻击$()$(br)分4个阶段。在第一个（也是最棘手的一个）阶段，它会召唤数个混沌凋灵干扰玩家。它们比普通的凋灵更强大，始终盯着玩家不放。$(br2)如果你杀光了这些凋灵，混沌守卫会进行3轮区域轰炸。$(br2)首先，它会轰炸岛外围（所以躲在中心区域吧）。$(br2)然后，它会轰炸中心区域。跑到外围去，小心流弹。"
        },
        {
            "type": "text",
            "text": "最后它会随机轰炸整个岛屿，要活下来，最好的方式是跑到外围区域，同时躲避来袭的火球。你会需要几个充能的不死模块的。"
        }
    ]
}